import streamlit as st
import pandas as pd

# 餐厅数据
restaurants_data = {
    "餐厅": ["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"],
    "latitude": [22.853838, 22.965046, 22.812200, 22.809105, 22.839699],
    "longitude": [108.222177, 108.353921, 108.266629, 108.378664, 108.245804]
}

#地图
st.header("🌎地图")
mp_df=pd.DataFrame(restaurants_data)
st.map(mp_df)

st.markdown("***")#分割线

#条形图
st.header("⭐️餐厅评分")
pf_data={
	"餐厅": ["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"],
	"评分": [4.2, 4.5, 4.0, 4.7, 4.3]
}
pf_df=pd.DataFrame(pf_data)# 根据上面创建的data，创建数据框
st.bar_chart(pf_df,x='餐厅')# 通过x指定餐厅所在这一列为条形图的x轴
pf_df.set_index('餐厅', inplace=True)# 修改df，用餐厅列作为df的索引，替换原有的索引

st.markdown("***")

#折线图
st.header("💰️不同类型餐厅价格")
pr_data={
	"类型": ["快餐", "中餐", "快餐", "自助餐", "西餐"],
	"人均消费(元)": [15, 20, 25, 35, 50],
}
pr_df = pd.DataFrame(pr_data)
st.line_chart(pr_df, x='类型')# 通过x指定餐厅所在这一列为折线图的x轴
pr_df.set_index('类型', inplace=True)

#面积图
st.header("🍽用餐高峰期")
h_data={
	'月份':['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
	'星艺会尝不忘':[165,156,165,253,461,134,164,135,151,546,615,878],
	'高峰柠檬鸭':[425,324,363,215,455,136,454,133,452,452,458,846],
	'复记老友粉':[546,133,543,611,578,588,544,455,545,761,554,544],
	'好友缘':[543,554,841,123,864,524,468,451,323,586,631,566],
	'西冷牛排店':[233,231,464,354,548,465,564,587,216,125,154,546]
}
h_df = pd.DataFrame(h_data)
st.area_chart(h_df, x='月份')# 通过x指定月份所在这一列为面积图的x轴

st.markdown("***")

#价格走势折线图
st.header("💲价格走势")
data={
	'月份':['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
	'星艺会尝不忘':[13,12,13,11,14,15,12,13,14,11,13,14],
	'高峰柠檬鸭':[24,21,23,22,21,23,22,22,24,23,21,22],
	'复记老友粉':[16,15,14,17,18,19,14,16,15,17,18,14],
	'好友缘':[23,24,25,25,24,26,24,23,25,24,25,24],
	'西冷牛排店':[45,34,35,43,42,41,40,34,32,39,40,38]
}
df = pd.DataFrame(data)
st.line_chart(df, x='月份')
df.set_index('月份', inplace=True)